tap 'cjbassi/gotop'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'koekeishiya/formulae'
tap 'mike-engel/jwt-cli'
tap 'mopidy/mopidy'
tap 'sambadevi/powerlevel9k'
tap 'weaveworks/tap'

brew 'aws-okta'
brew 'aws-shell'
brew 'awscli'
brew 'azure-cli'
brew 'blueutil'
brew 'cjbassi/gotop/gotop'
brew 'cmake'
brew 'dep'
brew 'draft'
brew 'gnu-sed'
brew 'go@1.12'
brew 'golangci/tap/golangci-lint'
brew 'grip'
brew 'hadolint'
brew 'ipcalc'
brew 'istioctl'
brew 'jq'
brew 'koekeishiya/formulae/yabai', args: ['HEAD']
brew 'koekeishiya/formulae/skhd'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'librsvg' # to build kitty from source
brew 'macvim'
brew 'mas'
brew 'mike-engel/jwt-cli/jwt-cli'
brew 'mopidy/mopidy/mopidy-spotify'
brew 'ncmpcpp'
brew 'neofetch'
brew 'nmap'
brew 'node'
brew 'npm'
brew 'optipng' # kitty from source
brew 'p7zip'
brew 'pandoc'
brew 'pass'
brew 'pidof'
brew 'pipenv'
brew 'pulumi'
brew 'python@3'
brew 'ranger'
brew 'reattach-to-user-namespace'
brew 'sambadevi/powerlevel9k/powerlevel9k'
brew 'shellcheck'
brew 'sl'
brew 'sops'
brew 'stow'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'typescript'
brew 'tldr'
brew 'tmux'
brew 'vsts-cli'
brew 'watch'
brew 'weaveworks/tap/eksctl'
brew 'wget'
brew 'wifi-password'
brew 'yarn'
brew 'yq'
brew 'zsh-autosuggestions'

brew 'adns' # [required by: gnupg]
brew 'boost' # [required by: ncmpcpp]
brew 'cairo' # [required by: gobject-introspection, gst-plugins-good, harfbuzz, pango, py2cairo, py3cairo]
brew 'cscope' # [required by: macvim]
brew 'faac' # [required by: gst-plugins-bad]
brew 'faad2' # [required by: gst-plugins-bad]
brew 'fftw' # [required by: ncmpcpp]
brew 'flac' # [required by: gst-plugins-good, gst-plugins-ugly]
brew 'fontconfig' # [required by: cairo, gd, pango]
brew 'freetype' # [required by: cairo, fontconfig, gd, harfbuzz]
brew 'fribidi' # [required by: pango]
brew 'gcc' # [required by: fftw, open-mpi]
brew 'gd' # [required by: graphviz]
brew 'gdbm' # [required by: python, python@2]
brew 'gettext' # [required by: glib, gnu-getopt, gnupg, gst-plugins-bad, gst-plugins-base, gst-plugins-good, gst-plugins-ugly, gstreamer, gts, libidn2, vala, vim, watch]
brew 'glib' # [required by: cairo, glib-networking, gobject-introspection, gsettings-desktop-schemas, gstreamer, gts, harfbuzz, libmms, pango, vala]
brew 'glib-networking' # [required by: libsoup]
brew 'gmp' # [required by: gcc, gnutls, isl, libmpc, mpfr, nettle]
brew 'gnu-getopt' # [required by: pass]
brew 'gnupg' # [required by: pass]
brew 'gnutls' # [required by: glib-networking, gnupg, libsoup]
brew 'go' # [required by: dep]
brew 'gobject-introspection' # [required by: pygobject3]
brew 'graphite2' # [required by: harfbuzz]
brew 'graphviz' # [required by: vala]
brew 'gsettings-desktop-schemas' # [required by: glib-networking]
brew 'gst-plugins-bad' # [required by: mopidy/mopidy/mopidy]
brew 'gst-plugins-base' # [required by: gst-plugins-bad, gst-plugins-good, gst-plugins-ugly, gst-python, mopidy/mopidy/mopidy]
brew 'gst-plugins-good' # [required by: mopidy/mopidy/mopidy]
brew 'gst-plugins-ugly' # [required by: mopidy/mopidy/mopidy]
brew 'gst-python' # [required by: mopidy/mopidy/mopidy]
brew 'gstreamer' # [required by: gst-plugins-base]
brew 'gts' # [required by: graphviz]
brew 'harfbuzz' # [required by: pango]
brew 'icu4c' # [required by: boost, harfbuzz]
brew 'isl' # [required by: gcc]
brew 'jasper' # [required by: netpbm]
brew 'jpeg' # [required by: gd, gst-plugins-bad, gst-plugins-good, gst-plugins-ugly, jasper, libtiff, netpbm, webp]
brew 'kubernetes-cli' # [required by: kubectx]
brew 'lame' # [required by: gst-plugins-ugly]
brew 'libassuan' # [required by: gnupg, pinentry]
brew 'libevent' # [required by: open-mpi, tmux, unbound]
brew 'libffi' # [required by: glib, gobject-introspection, mopidy/mopidy/pyspotify, p11-kit]
brew 'libgcrypt' # [required by: gnupg]
brew 'libgpg-error' # [required by: gnupg, libassuan, libgcrypt, libksba, pinentry]
brew 'libidn2' # [required by: libpsl, wget]
brew 'libksba' # [required by: gnupg]
brew 'libmms' # [required by: gst-plugins-bad, gst-plugins-ugly]
brew 'libmpc' # [required by: gcc]
brew 'libmpdclient' # [required by: ncmpcpp]
brew 'libogg' # [required by: flac, gst-plugins-base, libshout, libvorbis, speex, theora]
brew 'libpng' # [required by: cairo, freetype, gd, graphviz, gst-plugins-good, netpbm, qrencode, webp]
brew 'libpsl' # [required by: libsoup]
brew 'libshout' # [required by: gst-plugins-good, gst-plugins-ugly]
brew 'libsoup' # [required by: gst-plugins-good]
brew 'libtasn1' # [required by: gnutls]
brew 'libtiff' # [required by: gd, netpbm]
brew 'libtool' # [required by: graphviz]
brew 'libunistring' # [required by: gnutls, libidn2]
brew 'libusb' # [required by: gnupg]
brew 'libvorbis' # [required by: gst-plugins-base, gst-plugins-ugly, libshout, theora]
brew 'libvpx' # [required by: gst-plugins-good]
brew 'libyaml' # [required by: ruby]
brew 'libzip' # [required by: tldr]
brew 'lua' # [required by: macvim, vim]
brew 'mopidy/mopidy/libspotify' # [required by: mopidy/mopidy/pyspotify]
brew 'mopidy/mopidy/mopidy' # [required by: mopidy/mopidy/mopidy-spotify]
brew 'mopidy/mopidy/pyspotify' # [required by: mopidy/mopidy/mopidy-spotify]
brew 'mpfr' # [required by: gcc, libmpc]
brew 'ncurses' # [required by: ncmpcpp, tmux, zsh]
brew 'netpbm' # [required by: gts]
brew 'nettle' # [required by: gnutls]
brew 'npth' # [required by: gnupg]
brew 'oniguruma' # [required by: jq]
brew 'open-mpi' # [required by: fftw]
brew 'openssl' # [required by: gst-plugins-bad, libevent, python, python@2, ruby, unbound, wget]
brew 'opus' # [required by: gst-plugins-bad, gst-plugins-base]
brew 'orc' # [required by: gst-plugins-bad, gst-plugins-base, gst-plugins-good]
brew 'p11-kit' # [required by: gnutls]
brew 'pango' # [required by: gst-plugins-base, gst-plugins-ugly]
brew 'pcre' # [required by: glib, the_silver_searcher, zsh]
brew 'perl' # [required by: vim]
brew 'pinentry' # [required by: gnupg]
brew 'pixman' # [required by: cairo]
brew 'pkg-config' # [required by: gobject-introspection, vala]
brew 'py2cairo' # [required by: pygobject3]
brew 'py3cairo' # [required by: pygobject3]
brew 'pygobject3' # [required by: gst-python]
brew 'python' # [required by: glib, gobject-introspection, gst-python, macvim, py3cairo, pygobject3, vim, vsts-cli]
brew 'python@2' # [required by: py2cairo, pygobject3]
brew 'qrencode' # [required by: pass]
brew 'readline' # [required by: ncmpcpp, python, python@2, ruby, sqlite]
brew 'ruby' # [required by: vim]
brew 'speex' # [required by: gst-plugins-good, libshout]
brew 'sqlite' # [required by: python, python@2]
brew 'taglib' # [required by: gst-plugins-good, ncmpcpp]
brew 'theora' # [required by: gst-plugins-base, gst-plugins-ugly, libshout]
brew 'tree' # [required by: pass]
brew 'unbound' # [required by: gnutls]
brew 'vala' # [required by: libsoup]
brew 'webp' # [required by: gd]
brew 'x264' # [required by: gst-plugins-ugly]
brew 'xz' # [required by: python, the_silver_searcher]
brew 'zsh' # [required by: sambadevi/powerlevel9k/powerlevel9k]

cask 'docker'
cask 'duet'
cask 'firefox'
cask 'font-fira-code'
cask 'google-cloud-sdk'
cask 'java'
cask 'kitty'
cask 'minikube'
cask 'postman'
cask 'powershell'
cask 'qutebrowser' # https://github.com/qutebrowser/qutebrowser/issues/4067
cask 'ubersicht'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
