tap 'cjbassi/gotop'
tap 'koekeishiya/formulae'
tap 'mopidy/mopidy'
tap 'sambadevi/powerlevel9k'

brew 'blueutil'
brew 'cmake'
brew 'chunkwm'
brew 'gotop'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'gnu-sed'
brew 'mas'
brew 'mopidy'
brew 'mopidy-spotify'
brew 'ncmpcpp'
brew 'npm'
brew 'pass'
brew 'pidof'
brew 'powerlevel9k'
brew 'pulumi'
brew 'python@2'
brew 'reattach-to-user-namespace'
brew 'skhd'
brew 'stow'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'vsts-cli'
brew 'watch'
brew 'wget'
brew 'zsh-autosuggestions'

cask 'docker'
cask 'google-cloud-sdk'
cask 'kitty'
cask 'minikube'
cask 'ubersicht'
cask 'qutebrowser'
cask 'virtualbox'
